# Экзамен и проходной балл

**Описание:**  
Преподаватель отправил студентам ведомости с оценками за экзамен. Определите, кто из студентов набрал проходной балл: 35 баллов или больше. Максимальный балл за экзамен — 55 баллов. Если никто не набрал проходной балл, верните «Никто».

**Формат ввода:**  
Две строки. Первая строка — целые числа, означающие баллы учеников (0 ≤ x ≤ 55), они разделены запятой.  
Вторая строка — имена учеников, также разделённые через запятую, что количество оценок и имён в двух строках совпадают.

**Формат вывода:**  
Имена тех учеников, которые набрали проходной балл на экзамене, в их изначальном порядке. Каждое имя должно начинаться с новой строки, в выводе не должно быть запятых. Строка «Никто», если никто не набрал проходной балл.

**Код:**
```csharp
using System;
using System.Collections.Generic;

class Program
{
    static void Main()
    {
        string scoreString = Console.ReadLine();
        string nameString = Console.ReadLine();

        List<string> passedStudents = FilterPassedStudents(scoreString, nameString);
        foreach (string student in passedStudents)
        {
            Console.WriteLine(student);
        }
    }

    static List<string> FilterPassedStudents(string scoreString, string nameString)
    {
        // Ваш код
        throw new NotImplementedException();
    }
}
```

**Пример 1:**  
Входные данные:  
0,0,55,55  
Katrin,Marina,Vital,Ramin

Выходные данные:  
Vital  
Ramin

**Пример 2:**  
Входные данные:  
1,2  
Alex,Ivan

Выходные данные:  
Никто

---

# Учебник по геометрии

**Описание:**  
Вы разрабатываете интерактивный учебник по математике для 7-го класса: работаете над заданиями к теоретическим главам по геометрии.

В прямоугольном треугольнике квадрат гипотенузы равен сумме квадратов двух других сторон (катетов). Напишите программу, которая по заданным длинам сторон треугольника определяет, является ли он прямоугольным. Если треугольник прямоугольный, выведите «Да», если нет — «Нет». Программа не должна проверять, действительно ли существует треугольник с заданными сторонами.

**Формат ввода:**  
Три положительных целых числа a, b и c (1 <= a, b, c <= 1000) — это длины сторон треугольника. Длины идут в произвольном порядке.

**Формат вывода:**  
Одна из двух фраз (без кавычек): «Да» или «Нет».

**Код:**
```csharp
using System;

class Program
{
    static void Main()
    {
        string sideString = Console.ReadLine().Trim();
        if (IsRightTriangle(sideString))
        {
            Console.WriteLine("Да");
        }
        else
        {
            Console.WriteLine("Нет");
        }
    }

    static bool IsRightTriangle(string sideString)
    {
        // Ваш код
        throw new NotImplementedException();
    }
}
```

**Пример 1:**  
Входные данные:  
3 4 5

Выходные данные:  
Да

**Пример 2:**  
Входные данные:  
1 2 3

Выходные данные:  
Нет

---

# Чувствительная информация

**Описание:**  
Узнать номер карты или телефон человека иногда можно, просто заглянув ему через плечо. Чтобы обезопасить своих пользователей, разработчики скрывают эти данные, оставляя только последние цифры. Ваша задача — написать функцию, которая преобразует все символы, кроме последних четырех, в «#» (решетку).

**Формат ввода:**  
Одна строка произвольных символов, обозначающих, например, номер карты, телефон человека или ключ доступа API. Длина строки — не больше 100 символов. В строке гарантированно отсутствуют пробелы.

**Формат вывода:**  
Одна строка, в которой содержатся решётки и четыре цифры или буквы. Если длина строки меньше 4 символов, выведите всё, что было изначально.

**Код:**
```csharp
using System;

class Program
{
    static void Main()
    {
        string stringToMask = Console.ReadLine();
        string result = Mask(stringToMask);
        Console.WriteLine(result);
    }

    static string Mask(string stringToMask)
    {
        // Ваш код
        throw new NotImplementedException();
    }
}
```

**Пример 1:**  
Входные данные:  
123456789

Выходные данные:  
#####6789

**Пример 2:**  
Входные данные:  
abc

Выходные данные:  
abc

---
