# Дорогие товары

**Описание:** Вы разрабатываете программу для учета продаж в интернет-магазине. На вход программе подается список цен товаров. Вам необходимо определить, какие товары стоят дороже средней цены всех товаров из списка – на такие товары впоследствии применяется скидка. Если таких товаров нет, выведите «Нет».

**Формат ввода:** Одна строка, содержащая список целых или дробных чисел (цен товаров), разделенных запятой. Числа находятся в диапазоне 0\<x\<1000000.

**Формат вывода:** Цены, которые превышают среднюю цену по всем товарам из списка, с сохранением исходного порядка. Цены, равные средней, НЕ выводятся. Каждая цена должна быть выведена на новой строке. Если таких цен нет, выводится «Нет».

**Код:**
```python
def find\_expensive\_items(prices\_string):  
    """Ваш код"""

prices\_string \= input()  
result \= find\_expensive\_items(prices\_string)  
print(result)
```
Пример 1:  
Входные данные:  
`10,20,30,40,50`

Выходные данные:

`40`<br>
`50`

Пример 2:  
Входные данные:  
`5,5,5,5`

Выходные данные:

`Нет`

# Цензура

**Описание:** Вы разрабатываете программу для фильтрации нецензурных выражений в соцсетях. Требуется обработать строку таким образом, чтобы запрещенные слова в ней были заменены.

Формат ввода: Две строки: одна – содержащая оригинальный текст, вторая – содержащая запрещённые слова, разделённые запятыми. Входная строка содержит только буквы, пробелы и символы .?\!.  
Длина строк – от 10 до 250 символов.  

**Формат вывода:** Оригинальная строка, в которой все запрещенные слова заменены на последовательность символов '\#' совпадающей длины. Запрещенные слова заменяются при полном совпадении без учёта регистра. Формы слов (например, «столы» и «стол») не учитываются и считаются разными словами.

**Код:**
```python
def censor(text: str, blacklist: str) \-\> str:  
    """Ваш код"""

text \= input()  
blacklist \= input()  
censored\_text \= censor(text, blacklist)  
print(censored\_text)
```
Пример 1:  
Входные данные:  
`кот, из-за которого пришлось купить новую посуду.` 
`кот,новую`

Выходные данные:

`###, из-за которого пришлось купить #### посуду.`

Пример 2:  
Входные данные:  
`Книга не показалась ему особенно занимательной, модерну он предпочитал постмодерн.`
`модерн,книга,особенно`

Выходные данные:

`##### не показалась ему ######## занимательной, ####### он предпочитал постмодерн.`

# Чувствительная информация

**Описание:** Узнать номер карты или телефон человека иногда можно, просто заглянув ему через плечо. Чтобы обезопасить своих пользователей, разработчики скрывают эти данные, оставляя только последние цифры. Ваша задача – написать функцию, которая преобразует все символы, кроме последних четырех, в «\#» (решетку).

**Формат ввода:** Одна строка произвольных символов, обозначающих, например, номер карты, телефон человека или ключ доступа API. Длина строки — не больше 100 символов. В строке гарантированно отсутствуют пробелы.

**Формат вывода:** Одна строка, в которой содержатся решётки и четыре цифры или буквы. Если длина строки меньше 4 символов, выведите всё, что было изначально.

**Код:**
```python
def mask(string\_to\_mask: str) \-\> str:  
    """Ваш код"""

string\_to\_mask \= input()  
result \= mask(string\_to\_mask)  
print(result)
```
Пример 1:  
Входные данные:  
`123456789`

Выходные данные:

`#####6789`

Пример 2:  
Входные данные:  
`abc`

Выходные данные:

`abc`

# Система оценивания

**Описание:** Вы работаете над программой для автоматического оценивания работ студентов. Требуется определить число студентов, получивших проходной балл по результатам проверки. Проходной балл – 60\. Максимальная оценка – 100 баллов.

**Формат ввода:** Строка, содержащая разделенные пробелами целые числа в диапазоне от 0 до 100\.

**Формат вывода:** Строка формат «Прошли число\_прошедших, не прошли число\_не\_прошедших».

**Код:**
```python
def passing\_scores(scores: str) \-\> str:  
    """Ваш код"""

scores \= input()  
result \= passing\_scores(scores)  
print(result)
```
Пример 1:  
Входные данные:  
`50 60 70 80 90`

Выходные данные:

`Прошли 4, не прошли 1`

Пример 2:  
Входные данные:  
`78 81 50 12 60 11`

Выходные данные:

`Прошли 3, не прошли 3`

# Обработка гласных

**Описание:** Вы разрабатываете систему фильтрации текстовых данных. Необходимо реализовать функцию, которая заменяет все гласные буквы в тексте на символ '\*'.

**Формат ввода:** Одна строка текста. Длина строки от 1 до 100 символов. Строка может содержать буквы русского языка в разных регистрах, а также пробелы и специальные символы.

**Формат вывода:** Строка, в которой все гласные заменены на '\*'. В остальном – сохранено исходное написание, включая регистр, пробелы и специальные символы.

**Код:**
```python
def filter\_vowels(text: str) \-\> str:  
    """Ваш код"""

text \= input()  
result \= filter\_vowels(text)  
print(result)
```
Пример 1:  
Входные данные:  
`Мама мыла раму`

Выходные данные:

`М*м* м*л* р*м*`

Пример 2:  
Входные данные:  
`aaaaaa`

Выходные данные:

`******`
